app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @company = Company.find(params[:id])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @company = Company.find(params[:id])

INSERT INTO "companies" ("contact", "created_at", "employeeCount", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["contact", "KaTanya Williams"], ["created_at", Sat, 07 Sep 2013 01:25:19 UTC +00:00], ["employeeCount", 25], ["name", "Black Oak"], ["updated_at", Sat, 07 Sep 2013 01:25:19 UTC +00:00]]
---
  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "companies" SET "contact" = 'Courtney Matthews', "updated_at" = '2013-09-07 02:34:57.712726' WHERE "companies"."id" = 5
---
  def update
    @company = Company.find(params[:id])

    respond_to do |format|
      if @company.update_attributes(params[:company])