app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @note = Note.find(params[:id])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @note = Note.new
    @company = Company.find(params[:company_id])

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @note = Note.find(params[:id])

SELECT "companies".* FROM "companies" WHERE "companies"."name" = 'Black Oak' LIMIT 1
INSERT INTO "notes" ("company_id", "created_at", "details", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    params[:note]["company"] = Company.find_by_name  params[:note]["company"]
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save